"""Модуль с цветовой палитрой из файла tiles.png"""
# Названия цветов взяты с сайта http://chir.ag/projects/name-that-color
# Ко всем цветам добавил упрощённое название


BLACK = (0, 0, 0)  # Чёрный
POTTERS_CLAY = (153, 102, 51)  # Коричневый
CELERY = (187, 187, 85)  # Бледно-жёлтый
BAY_OF_MANY = (34, 51, 119)  # Тёмно-синий
INDIGO = (68, 119, 204)  # Синий
MINE_SHAFT = (51, 51, 51)  # Тёмно-серый
FIORD = (68, 85, 102)  # Серо-голубой
ALTO = (221, 221, 221)  # Белый
APPLE = (102, 153, 68)  # Ярко-зелёный
IRISH_COFFEE = (85, 68, 34)  # Тускло-коричневый
BOULDER = (119, 119, 119)  # Серый
GONDOLA = (34, 17, 34)  # Тёмно-фиолетовый (баклажановый)
CUMIN = (136, 68, 34)  # Коричневый
SANTA_FE = (187, 119, 85)  # Бежевый
PETITE_ORCHID = (221, 153, 136)  # Бежевый (цвет кожи)
TRADEWIND = (102, 187, 187)  # Бирюзовый
